Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Generally the default settings of 16 bit, 44100kHz and 192kbps are perfectly adequate, but it may be that you wish sound effects (for example) to have a lower quality and music to have a higher quality, in which case these settings can be changed.
zh_cn: 一般默认设置 16 bit, 44100kHz and 192kbps 即可，但如果你希望你的音效质量较低、音乐质量较高，也可以改变设置以达到目的。

source: Generally there are two types of functions - First of all, there is the huge collection of built-in functions which are used to control all aspects of your game, and, secondly, any scripts you define in your game can also be used as a function (but not always).
zh_cn: 基本上有两类函数 - 首先是大量的内置函数，控制游戏的所有方面，其次是任何你在游戏中定义的脚本也可以当作函数使用（但不总是这样）。

source: Get the current vertical synchronisation method (Windows Only).
zh_cn: 获取当前的垂直同步方法（只适用于windows）。

source: Get the position for default drawing of the application surface.
zh_cn: 获取应用表面层默认绘制的位置

source: Gets the buffer method used on the Windows target platform.
zh_cn: 获取 Windows 目标平台的缓冲区方法。

source: Gets the colour of the region inside the window/browser but outside the visible views (default is black).
zh_cn: 获取窗口/浏览器内侧，但是可见视野外侧区域的颜色（默认黑色）。

source: Gets the current cursor being used in the game window.
zh_cn: 获取游戏窗口内当前使用的指针。

source: Gets the current draw alpha value.
zh_cn: 获取当前的绘制透明度值。

source: Gets the width of the window.
zh_cn: 获取窗口的宽度。

source: Gets the x position of the window inside the browser/visible area of the screen.
zh_cn: 获取浏览器或者屏幕显示区域的内部窗口的x坐标。

source: Gets the y position of the window inside the browser/visible area of the screen.
zh_cn: 获取浏览器或者屏幕显示区域的内部窗口的y坐标。

source: Getting Started
zh_cn: 入门

source: Global Game Settings
zh_cn: 全局游戏设定

source: Globals
zh_cn: Globals（全局）

source: Good for keeping track of cards and hands and can even be shuffled!
zh_cn: 有利于跟踪卡牌和手，甚至可以打乱顺序。

source: Graph
zh_cn: Graph（图表）

source: Hardware virtualisation
zh_cn: 硬件虚拟化

source: Height of the view in the room.
zh_cn: 房间视野的高度。

source: Height of the viewport in the drawing region.
zh_cn: 绘制区域的视口高度。

source: Help contents
zh_cn: 帮助 内容

source: Here are some examples of use:
zh_cn: 这里还有一些使用的例子：

source: Here are some final examples of the various different expressions:
zh_cn: 对于不同的表达式，最后还有一些例子以供参考：

source: Here is a brief overview of the function of each of those tabs:
zh_cn: 下面是上述选项卡的功能概述:

source: Here is a list of them and you should know that they will all play a crucial role in creating your game:
zh_cn: 下面是它们的列表，你应该了解它们，因为它们将在你的游戏中发挥重要的作用:

source: Here is a more visual representation of how a code block can look, this time created as a script in the GameMaker: Studio Script Editor:
zh_cn: 下面这个 脚本（script）更加直观地演示 GameMaker: Studio代码段“ 长什么样子”，在Script Editor中：

source: Here is a short example script called "scr_sqr" which calculates the square of whatever value is passed to it, and it includes error catching in case the argument that it is passed is not a real number:
zh_cn: 下面是一个简单的例子，设计了一个脚本“scr_sqr”用来计算正方形的面积，可以向它传递任何参数，它包含一个错误捕捉，如果传递的不是实例将会跳出：

source: Here is an example of how a typical object looks:
zh_cn: 下面是一个典型的物体的样子:

source: Here is an example of how the room editor typically looks:
zh_cn: 接下来看一个房间编辑器的例子:

source: Here is an extended example:
zh_cn: 下面有一些例子：

source: Here is an outline of the structure of a function:
zh_cn: 下面是函数结构的轮廓：

source: Here is one final example of how this may be used in an actual game...
zh_cn: 实际游戏中怎么用呢，请看下面的你还子：

source: Here we explain how to use the "exit" statement.
zh_cn: 这里将解释怎样使用“exit”语句。

source: Here we talk about how you can distribute your finished game.
zh_cn: 在这里讨论的是如何发布你的作品。

source: Here you can add the code you need and it will be run when every time the room is entered.
zh_cn: 在里面添加的代码将会在每次进入房间时运行。

source: Here you can also indicate a couple of things that you'd like GameMaker: Studio to do when you import the sprite, like make opaque (remove any transparent parts), remove the background colour (if it has one) making it transparent, or whether to smooth the edges of the sprite (only if it is transparent), which can greatly improve its appearance.
zh_cn: 当你导入 GameMaker: Studio 精灵时在这里你还可以选择不透明 (去除任何透明部分)、去除背景色 (如果有使其透明)或者平滑边缘(如果它是透明的)。

source: Here you can find a drop-down menu that permits you to select the current configuration of GameMaker: Studio and beside this there is a button labelled "Manage".
zh_cn: 在这个下拉菜单你可以找到当前 GameMaker: Studio 的配置信息，旁边有一个 "Manage (管理)" 按钮。

source: Here you can find all the information about the Steam Player.
zh_cn: 在这里你可以找到所有关于 Steam 玩家的信息。

source: Here you can find all the information about the Steam Workshop target module.
zh_cn: 在这里你可以找到所有有关 Steam Workshop 目标模块的信息。

source: Here you can find out all about the various options available to you from the drop down edit menu.
zh_cn: 在这里你可以找到编辑菜单中提供的的各种选项。

source: Here you can find out all about the various options available to you from the drop down file menu.
zh_cn: 在这里你可以找到文件菜单中提供的的各种选项。

source: Here you can find out all about the various options available to you from the drop down help menu.
zh_cn: 在这里你可以找到帮助菜单中提供的的各种选项。

source: Here you can find out how a basic code block is structured using GML.
zh_cn: 在这里你将学到：怎样使用GML构建代码段。

source: Here you can find references for many of the GameMaker: Studio features, as well as a rundown of all of the functions, variables and constants that make up the built-in programming language.
zh_cn: 这里可以找到许多 GameMaker: Studio 特性的参考，也有所有内置函数、变量和常量的摘要。

source: Here you can find various methods for addressing variables in other Instances.
zh_cn: 在这里你可以找到多种方法访问其它实例的变量。

source: Here you can learn about the "do" statement.
zh_cn: 这一节将学习“do”语句。

source: Here you can load different file types (and even create sub-directories for them) into GameMaker: Studio and they will then be included in the final game as part of the final package for the target platform.
zh_cn: 在这里你可以向 GameMaker: Studio 中加载各种类型的文件（你甚至可以给它们创建子文件夹)。这些文件将会被作为游戏的一部分打包进目标平台可执行文件中。

source: Here you will see a "tree" view of all the resources in your game.
zh_cn: 在这里你可以看到游戏中所有资源的树视图。

source: High scores and other statistics.
zh_cn: 高分榜和其它统计。

source: Home
zh_cn: 首页

source: However additional modules can be purchased easily from the YoYo Games Checkout.
zh_cn: 额外的模块可以轻松地从 YoYo Games Checkout. 购买到。

source: However if you are manipulating this surface and wish to draw it yourself, then this function gives you an easy way to find exactly where within the display or window that the surface was being drawn so that you can then draw it there yourself, or align GUI images or post draw images to it.
zh_cn: 但是如果你想自己操作表面进行绘制，这个函数可以让你 在显示器或窗口方便的找到表面层绘制的位置，然后在那里绘制，或者对齐GUI图片或者上面绘制图片。

source: However if you have more than one instance of the given object in the room, then it will apply to ALL of them equally - unless you are using one of the JS targets or HTML5, in which case it will affect only one, but you have no way of knowing which one it will affect - so if you need to access all instances of an object, you should be using with, as that is 100% cross platform compatible.
zh_cn: 然而如果房间里有给定物体的多个实例，那么它将应用于所有的实例 - 除非你你正在使用一个 JS 平台，或者 HTML5输入平台，那种情况它将只会影响一个，但是你不会知道它影响的是哪一个 - 如果你需要访问一个物体的所有实例，应该使用 with，这会100%兼容所有的平台。

source: However on some older devices and specific chipsets this may result in poorer performance.
zh_cn: 然而在一些旧设备或特定的芯片组上，这可能会导致很差的性能。

source: However this is easily mimicked by the use of the following script:
zh_cn: 然而使用起来很方便，仿照下面的脚本：

source: However this is not always what you want and so you can use this function to set it to be drawn relative to the absolute (0,0) position of the display or game window.
zh_cn: 然而你不想总是这种情况，所以可以设置为相对于屏幕和窗口的绝对位置(0,0)。

source: However you can remove any ranges from your font resource using the "-" button at the bottom of the window and so remove those unwanted characters.
zh_cn: 当然你可以通过点你底部的“-”按钮来移除任何你不想要保留的字符范围。

source: However you can supply a variable number of arguments to a script using the built in argument array, argument[0 ... 15].
zh_cn: 而且你也可以使用内置参数数组提供许多参数， 他们是 argument[0 ... 15]。

source: However, anyone with a direct link may also view it.
zh_cn: 然而，直接点击链接也可以访问。

source: However, apart from this application surface, you can also create your own surfaces and use them to create stunning or subtle special effects in your game.
zh_cn: 此外，除了应用表面，也可以创建自己的表面层，游戏中用来设计一些华丽的特效。

source: However, due to the way that GameMaker: Studio stores certain things, the Debug Module does not always know just what the variable holds.
zh_cn: 然而，由于GameMaker: Studio存储特定事物的方法，调试模块并不总是知道变量中存了些什么。

source: However, if you use this function to set the window size, the 1:1 ratio is maintained, even though the image is scaled to fit the new window size.
zh_cn: 尽管如此，如果你使用这个函数设置窗口大小，即使图像自适应至新的窗口大小，图像与窗口的缩放比例仍然保持1:1。

source: However, if you wish to publish this game through the Microsoft Store for Windows, you must have a Microsoft Developers Licence which is available by signing up for an account here.
zh_cn: 然而，如果您希望通过 Windows 应用商店发布这个游戏，您 must 拥有一个 Microsoft Developers Licence (微软开发许可证账号) 可以在 这里 注册这个账号。

source: However, it is not a normal surface and advanced users will find that it enables complete control over how and when things are drawn in GameMaker: Studio.
zh_cn: 然而，这 并不是 一个普通的表面层，专业的用户会发现 GameMaker: Studio中允许在绘制的方式和时机上对它有完全的控制。

source: However, make the horizontal view border 0 and the instance must be right on the edge of the view before it will move.
zh_cn: 然而，设置横向视野边界为0，跟随的实例正好在视野边缘时，视野才会移动

source: However, make the vertical view border 0 and the instance must be right on the edge of the view before it will move.
zh_cn: 然而，设置纵向视野边界为0，跟随的实例正好在视野边缘时，视野才会移动。

source: However, on the left, instead of an event list we have a moment list.
zh_cn: 不过在左边不再是时间列表，取而代之的是一个被称作 时刻 的列表。

source: However, once set up correctly, GameMaker: Studio games will receive these notifications, which can then be dealt with in the Asynchronous Push Event, as you would a local notification.
zh_cn: 然而，一旦你正确的设置， GameMaker: Studio 开发的游戏将能够接收到这些通知， 然后在 异步推送事件（Asynchronous Push Event）中，你将接收到一个本地通知。

source: However, should you change any of the array values, the array will be copied into a temporary array just for the script.
zh_cn: 尽管如此，不管你是否更改了数组的值，这个数组都会复制一个临时的数组，以供这个脚本使用。

source: However, sometimes it's not enough to get information about the game window and views only, and you really need to know things about the display itself.
zh_cn: 然而有时候只知道窗口和视野的信息并不够，你真的很需要知道显示器的信息。

source: However, this cache may become corrupted over time, or you may wish to do a full test with no caching being done previously, in which case you can clear the cache by pressing this button.
zh_cn: 然而这种缓存会随着时间毁去一部分或者你可能希望做一个没有缓存的完整测试，这个时候你可以按这个按钮清除缓存。

source: However, this is a legacy from old GameMaker versions and you should use the == operators for comparing and = for assigning, as shown in these examples:
zh_cn: 然而，这是 GameMaker 老版本遗留下来的，比较运算还是应该使用 == 运算符，以及赋值使用 = ，举例如下：

source: However, when you decide to compile you game using the Create Executable command from the file menu or the icon from the toolbar you will be creating a special file which will be uploaded directly to the Steam Workshop.
zh_cn: 然而，当你决定使用文件菜单的 Create Executable 命令或者工具栏上相应的图标编译你的游戏时，会生成一个特殊的文件，将会直接上传到 Steam Workshop。

source: However, you can select to Compressed audio should you wish to use that.
zh_cn: 你也可以选择 Compressed (压缩) 音频。

source: However, you can set the scaling factor for the GUI layer, and the width and height will be scaled by that amount.
zh_cn: 然而，也可以为GUI层设置 缩放因数 ，缩放的宽度取决于这个值的大小。

source: However, you can still get the application surface position and resize it in the CreateEvent or any other event without getting any errors and the values used will be relevant to the surface when it is created.
zh_cn: 然而，你仍然可以获取应用表面层的位置并且在 创建事件或任何其它事件中 重置大小，不会出现任何错误，使用的值也会在它创建时建立关联。

source: If a notification exists, the map is populated and the code then checks the "data" key for a specific string.
zh_cn: 如果通知存在， map 将被赋值，通过代码查找key为 "data"的特定字符串。

source: If an item has a + sign in front of it you can click on the sign to see the resources inside it (expand it).
zh_cn: 如果一个项前面有一个 +，你可以点击它来查看里面的资源(展开)。

source: If any of the following examples resolves to true then the code would be run:
zh_cn: 如果下面的例子得出 true ，“{}”里面的代码将会执行。

source: If it does exist, it then checks to see which view is currently being drawn and if it is view[1] it draws the surface.
zh_cn: 如果存在，然后会检测当前视野是哪一个，是 view[1]的话就绘制表面。

source: If it meets any of the required values then the corresponding code is executed.
zh_cn: 遇到了适当的条件后运行相应的代码。

source: If no case statement has the right value, execution is continued after the default statement (it is not required to have a default statement, in which case no action will be taken).
zh_cn: 如果没有一个case表达式正确，将会在“default”语句后继续（default并非必须，那时没有动作执行）。

source: If no name was specified before, you are asked for a new name.
zh_cn: 如果没有指定名字会被要求指定一个新名字。

source: If the application is running in the foreground when the notification is delivered, the application will still receive an Asynchronous Push Event, but the user will get no message displayed unless you create it yourself.
zh_cn: 如果接收到通知时程序正在前台运行，仍会接收到一个异步推送事件（Asynchronous Push Event），但不会有任何消息展示，除非你自己创建一个。

source: If the current game has changed you are asked whether you want to save it before proceeding.
zh_cn: 如果当前游戏已经改变会询问是否保存然后继续。

source: If the current view is anything other than view[0] the surface "surf" is drawn to the screen.
zh_cn: 如果当前视野不是view[0]，则绘制 "surf"这个表面到屏幕上。

source: If the instance is in collision, "other" will show the other instance (and it's variables) in the collision, but if it is a with then the "Self" instance becomes that which is running the code, while "Other" is then the instance that actually contains the with.
zh_cn: 如果实例正在碰撞，“other”会显示碰撞中的其他实例（以变量的形式），但如果是with的话，“self”实例就会变成运行代码的那个，而“other”就是之后实际包含with的那个实例。

source: If the string is found, the notification is cancelled and moves on to check the next notification until all in the queue have been checked.
zh_cn: 如果找到该字符串,则通知取消,继续检查队列中的下一个通知,直到所有通知都被检查。

source: If the the instance code being stepped through has the watched variable it will be shown here, meaning you can easily keep track of a value without having to search for it in the Locals or Globals windows.
zh_cn: 如果按步跳过的实例代码中包含被监视的变量，那么它就会在这里显示出来。这意味着你可以轻易追踪变量而不用在Locals（局部）或者Globals（全局）窗口中查找它。

source: If the view is a section of the room that the player can see, the port is the area of the screen on which this view is drawn, and as such you can distort and scale the view if it is a size other than the view port.
zh_cn: 如果说视野是玩家看见的房间的一部分，而视口是视野绘制在屏幕上的区域，所以如果视野不同于视口时，你可以对视野进行变形或缩放。

source: If the view is not view[0] the surface is drawn to the screen.
zh_cn: 如果当前视野不是 view[0]，将表面层绘制到屏幕上。

source: If there are multiple instances of this object, only one is followed (usually the first one created, but this is not guaranteed).
zh_cn: 如果物体有多个实例，只会跟随其中一个（通常是创建的第一个，但并不保证）。

source: If there is a notification alert and the user taps on it, then the game is launched and an Asynchronous Push Event is called where you can check the callback string that you specify and resolve the push based on its value.
zh_cn: 如果用户点击了推送的通知，游戏会被启动并且 异步推送事件（Asynchronous Push Event） 会被触发，用户需要检查回调的字符串，根据这个值来处理和解决这个推送通知。

source: If used inside of a statement that forms a loop (repeat, while, do... until or for), it will immediately jump back to the beginning of the loop as if the loop had run through and looped back (if used outside of a loop it acts as an exit statement, exiting the event).
zh_cn: 如果在循环语句中使用（repeat, while, do... until or for），它将立即跳到循环的起点（如果循环的外面使用，行为如同“exit”，退出事件）。

source: If you right-click on a value you can set its type (see Data Types, below) to see details of data structures.
zh_cn: 如果你在一个值上右击，那你就可以通过设定它的类型的方式（查看下方的数据类型）来观察他的数据结构的细节。

source: If you right-click on a value you can set its type (see Data Types, below), delete it or clear all watches from the window.
zh_cn: 右击变量值可以设定它的类型（见下文的数据类型）、删除它或者清理所有窗口中的监视值。

source: If you right-click on the window you can clear it or copy its contents to the clipboard.
zh_cn: 如果你右击窗口，你可以选择清空它，或者在剪贴板中复制它的内容。

source: If you are adding in code actions then these can also be named, as explained in the section on Scripts - Adding Comments and Naming Code Blocks.
zh_cn: 同样在这里你也可以使用命名化的 代码动作，如果你不知道什么是命名化的代码，你可以参见脚本 - 添加注释和命名块。

source: If you bought GameMaker: Studio through Steam you can also purchase these modules easily on-line from the same service, with no licence being required as Steam keeps track of your details for you.
zh_cn: 如果你是通过 Steam 购买的 GameMaker: Studio，你也能很容易的从相同的服务通道在线购买这些模块，并不需要许可证，因为 Steam 将处理这些细节。

source: If you changed the current game project then you will be asked whether you want to save it before the program closes.
zh_cn: 如果改变了当前游戏项目，则会询问是否保存。

source: If you choose not to tick any targets then that file will not be exported at all.
zh_cn: 如果你没有选择任何目标平台，那么这个文件就根本不会被导出至游戏中。

source: If you click on it, you will be asked to supply a file, and then once that is done you should click on OK.
zh_cn: 如果你点击它，会要求你提供一个文件。

source: If you click on the Delete button, the point selected will be removed from the path (there is an undo button at the top of the screen should you make a mistake).
zh_cn: 如果你点击的是 Delete 按钮，你选中的那个点将被从路径中删除（如果你不小心删错了，你可以使用之前提到的 撤销 按钮）。

source: If you click on this button and then click OK, GameMaker: Studio will automatically parse your game code for strings and then create different character ranges to cover all the text in your game.
zh_cn: 如果你点击这个按钮并确认，GameMaker: Studio 会自动解析你的游戏代码从中寻找字符串，然后创建相应的包含你游戏中全部文本的字符范围。

source: If you do a right click beside a line of code you can add a Breakpoint to the code (see below for more details on Breakpoints), and doing so again will remove it (you can also use the key , or the toggle option from the "Debug" drop down menu.
zh_cn: 你可以右击 一行代码的旁边来添加断点（后文有更多关于断点的细节），再右击一次来取消（也可以用，或者“Debug”下拉菜单中的toggle option选项）。

source: If you do not have access to a Tizen device, you may be able to use the Tizen Emulator, however you must also meet the following requirements for it to work correctly:
zh_cn: 如果你不能访问 Tizen 设备，你也可以使用 Tizen 模拟器，然而你必须满足以下需求以保证正常工作:

source: If you do not use this function (the default setting) then the GUI layer will be positioned with its (0,0) point at the same position as that for the application surface (the area where your game is being drawn) and the width and height will be stretched to fit the this surface, such that setting a GUI width of 256px with this function when the application surface is 512px would stretch those 256 pixels to fit, effectively making the pixels twice as large.
zh_cn: 如果你没有使用这个函数 (默认设置)， GUI层将被放置在同应用表面（游戏绘制的区域）一样的 (0,0)位置，宽度和高度将被拉伸以适合这个表面层，使用这个函数这样设置时宽度为256px的 GUI，当应用表面层是512px时，将会拉伸256像素为表面层的大小，使得像素放大两倍。

source: If you do nothing else at this point, when you run your game you will simply get a blank screen as all drawing is being done on the surface, but the surface itself is not being drawn anywhere.
zh_cn: 如果不做到这一步，运行游戏时将会简单的获得一个空白的屏幕，因为所有的绘制都是在表面里完成的，但是表面层并不会在任何地方绘制出来。

source: If you don't want the GUI layer, then you can save the screen before rendering the GUI (ie: in the Draw event), but if you do want GUI elements to be included, then you save after the Draw GUI event.
zh_cn: 如果你不想看到 GUI 层，你可以在渲染GUI（比如：在 绘制 事件中）之前保存，但是如果你真想看到GUI元素，那么在 Draw GUI 事件之后保存。

source: If you enable the window resize option in the Global Game Settings for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the maximum height to the size you specify.
zh_cn: 对于目标平台，如果你在全局游戏设定中允许窗口大小调整，那么玩家将可以调整窗口为任意想要的大小，尽管如此，通过这个函数，你可以限制调整的最大高度为指定值。

source: If you enable the window resize option in the Global Game Settings for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the maximum width to the size you specify.
zh_cn: 对于目标平台，如果你在全局游戏设定中允许窗口大小调整，那么玩家将可以调整窗口为任意想要的大小，尽管如此，通过这个函数，你可以限制调整的最大宽度为指定值。

source: If you enable the window resize option in the Global Game Settings for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the minimum height to the size you specify.
zh_cn: 对于目标平台，如果你在全局游戏设定中允许窗口大小调整，那么玩家将可以调整窗口为任意想要的大小，尽管如此，通过这个函数，你可以限制调整的最小高度为指定值。

source: If you enable the window resize option in the Global Game Settings for the target platform, then the player can resize the game window to any size they wish, however by using this function you can limit the minimum width to the size you specify.
zh_cn: 对于目标平台，如果你在全局游戏设定中允许窗口大小调整，那么玩家将可以调整窗口为任意想要的大小，尽管如此，通过这个函数，你可以限制调整的最小p宽度为指定值。

source: If you fire off a series of cloud_ requests then you need to know which one you are getting the reply to, and so you would use this value to compare to the value you stored when you originally sent the request to find the right one.
zh_cn: 如果你发送了一系列的 cloud_ 请求，你需要知道被回应的是哪一个，所以你要用这个值来和发送时存储的值进行比较来找到你需要的请求。

source: If you have "Uses Physics" selected then there will be another part visible in this window related to the physics options, but more on that later!
zh_cn: 如果你使用 "Uses Physics" 选项卡，就会看到物理相关的选项，但是更多的会在后面讲到！

source: If you have a larger or smaller port size than that assigned to the view, the view will be scaled down or up to fit, as illustrated by the image below.
zh_cn: 如果视口比分配的视野更大或更小，视野将被缩放以适应视口大小，如下图所示：

source: If you have a sprite strip image that you wish to load into GameMaker: Studio which does not have the above-mentioned format, this must be done from the Sprite Editor File Menu.
zh_cn: 如果你想加载到 GameMaker: Studio 的图片不是上述格式，你需要打开 Sprite Editor File Menu (精灵编辑器文件菜单)。

source: If you have an iOS developer account then with the iOS module you can also publish to iPad, iPhone and iPod
zh_cn: 如果你有一个iOS开发者账户和iOS模块也可以发布到ipad，iPhone和iPod

source: If you have bought GameMaker: Studio through Steam then you can also compile to the Steam Workshop.
zh_cn: •如果你在 Steam 上购买了 GameMaker: Studio 则可以编译到 Steam 创意工坊。

source: If you have bought GameMaker: Studio through Steam, you will also have an additional target module to export your games to the Steam Workshop.
zh_cn: 如果您在 Steam 上购买了 GameMaker: Studio，您还将拥有一个额外的目标模块发布您的游戏到 Steam 创意工坊.

source: If you have bought GameMaker: Studio through Steam, then on startup you will be presented with an options screen (shown below) from which you can select to Play games from the Steam Workshop, or to Make games with the program.
zh_cn: 如果你从 Steam 购买了 GameMaker: Studio ，在启动时可以看到一个选项 (见下图) ，可以选择从Steam Workshop Play (玩) 或者使用程序 Make (制作) 游戏。

source: If you have chosen compressed audio, you can then also choose to have your sound as streamed or not streamed.
zh_cn: 如果 你选择了 compressed 音频，你可以选择用 streamed 的方式播放或者 不是 。

source: If you have chosen to build HTML5, then an index.html (default name, but you can give your own name too) along with a folder containing your game's files will be created and saved to the specified location.
zh_cn: •如果你选择生成 HTML5，那么会生成一个含有 index.html (默认名称，可更改) 的包含你的游戏的文件夹，并保存到指定位置。

source: If you have chosen to change the name of the file when you added it to the resource tree, then the file will now be stored with that new name.
zh_cn: 如果你在添加文件时更改了文件的名字，那么这个文件将会用新的名称保存。

source: If you have different sizes, create two or more tile sets).
zh_cn: 如果有不同的尺寸，创建两套或更多磁贴。

source: If you have initialised any buffers in your game, then this window will show you the buffer data.
zh_cn: 如果你在游戏中初始化了缓冲器，这个窗口会给你显示缓冲数据。

source: If you have loaded an *.ogg file or an *.mp3 file into the IDE, you will be presented with a "quality" slider.
zh_cn: 如果你从 IDE 加载 *.ogg 或者 *.mp3 文件，你会看到 "品质" 滑块。

source: If you have no mask then you have no collision!
zh_cn: 如果没有遮罩就没有碰撞！
